# OverlappingSolids Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..MassFailures..::..OverlappingSolids Property
BuiltInFailures..::..MassFailures Class See Also
---
Found volumetric overlap between solids. They will be merged into one
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId OverlappingSolids { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OverlappingSolids As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ OverlappingSolids {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..MassFailures Class
Autodesk.Revit.DB Namespace